skocharyan/Mux/otherFiles/mw_stm32_spi_ll.h
    if((LL_SPI_GetMode((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==LL_SPI_MODE_MASTER) && (LL_SPI_GetTransferDirection((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==LL_SPI_HALF_DUPLEX_RX))
    {
        RxBuffSize = RxBuffSize-1;
    }

    if(LL_SPI_IsEnabled((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==0)
    {
        LL_SPI_Enable((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
    }

    if(FIFO_ACCESS_8BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint8_T *readdata = (uint8_T*) rdData;
        localVar = 0;
        while (localVar < RxBuffSize)
        {
            if(LL_SPI_IsActiveFlag_RXNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr) > 0)
            {
                readdata[localVar] = LL_SPI_ReceiveData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVar++;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
        }
    }
    else if(FIFO_ACCESS_16BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint16_T *readdata = (uint16_T*) rdData;
        localVar = 0;
        while (localVar < RxBuffSize)
        {
            if(LL_SPI_IsActiveFlag_RXNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr) > 0)
            {
                readdata[localVar] = LL_SPI_ReceiveData16((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVar++;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }

        }
    }

    error:
    if((LL_SPI_GetMode((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==LL_SPI_MODE_MASTER) && (LL_SPI_GetTransferDirection((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==LL_SPI_HALF_DUPLEX_RX))
    {
        LL_SPI_Disable((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
        if(RxBuffSize != datalength)
        {
            while(1){
                if(LL_SPI_IsActiveFlag_RXNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr) > 0)
                {
                    if(FIFO_ACCESS_8BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access){
                        uint8_T *readdata = (uint8_T*) rdData;
                        readdata[localVar] = LL_SPI_ReceiveData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);}
                    else if(FIFO_ACCESS_16BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access){
                        uint16_T *readdata = (uint16_T*) rdData;
                        readdata[localVar] = LL_SPI_ReceiveData16((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);}
                    break;
                }
                else
                {
                    if(returnTimeElapsed(initialTime, 1) > Timeout)
                    {
                        ret = MW_SPI_BUSY;
                        break;
                    }
                }
            }


        }
        #if !defined(STM32F4)
        while(LL_SPI_GetRxFIFOLevel((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr) > 0)
        {
            LL_SPI_ReceiveData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
        }
        #endif
    }

    return (MW_SPI_Status_Type)ret;
    #else
    return -1;
    #endif
}
#endif
#if defined(STM32H7) || defined(STM32U5)
__STATIC_INLINE MW_SPI_Status_Type MW_SPI_MasterWriteRead_Databits(STM32_SPI_ModuleStruct_T* SPIModuleHandle, const void * wrData, void * rdData, uint16_T fifo_access, uint32_T datalength, uint16_T blockingMode, uint32_T Timeout)
{
    #ifndef MATLAB_MEX_FILE
    uint16_T localVarTx;
    uint16_T localVarRx;
    uint16_T ret = MW_SPI_SUCCESS;
    uint32_T initialTime = 0;
    initialTime = GET_CURRENT_TIME();

    uint16_T TxAllowed =1;

    if(blockingMode==0)
    {Timeout=0;}

    if(LL_SPI_IsEnabled((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==0)
    {
        LL_SPI_Enable((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
    }

    if(FIFO_ACCESS_8BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint8_T *readdata = (uint8_T*) rdData;
        uint8_T *writedata = (uint8_T*) wrData;
        localVarTx = 0;
        localVarRx = 0;
        while (localVarTx < datalength || localVarRx < datalength)
        {
            if((1 == LL_SPI_IsActiveFlag_TXP ((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (TxAllowed==1) && (localVarTx < datalength))
            {
                LL_SPI_TransmitData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr, writedata[localVarTx]);
                localVarTx++;
                TxAllowed = 0;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
            if(((1 == LL_SPI_IsActiveFlag_RXWNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) || (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)>0)) && (localVarRx < datalength) && (TxAllowed==0))
            {
                readdata[localVarRx] = LL_SPI_ReceiveData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                //ret |= (uint16_T)LL_SPI_IsActiveFlag_OVR((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVarRx++;
                TxAllowed = 1;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
        }
    }
    else if(FIFO_ACCESS_16BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint16_T *readdata = (uint16_T*) rdData;
        uint16_T *writedata = (uint16_T*) wrData;
        localVarTx = 0;
        localVarRx = 0;
        while (localVarTx < datalength || localVarRx < datalength)
        {
            if((1 == LL_SPI_IsActiveFlag_TXP ((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (TxAllowed==1) && (localVarTx < datalength))
            {
                LL_SPI_TransmitData16((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr, writedata[localVarTx]);
                localVarTx++;
                TxAllowed = 0;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
            if(((1 == LL_SPI_IsActiveFlag_RXWNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) || (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)>0)) && (localVarRx < datalength) && (TxAllowed==0))
            {
                readdata[localVarRx] = LL_SPI_ReceiveData16((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                //ret |= (uint16_T)LL_SPI_IsActiveFlag_OVR((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVarRx++;
                TxAllowed = 1;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
        }
    }
    else if(FIFO_ACCESS_32BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint32_T *readdata = (uint32_T*) rdData;
        uint32_T *writedata = (uint32_T*) wrData;
        localVarTx = 0;
        localVarRx = 0;
        while (localVarTx < datalength || localVarRx < datalength)
        {
            if((1 == LL_SPI_IsActiveFlag_TXP ((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (TxAllowed==1) && (localVarTx < datalength))
            {
                LL_SPI_TransmitData32((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr, writedata[localVarTx]);
                localVarTx++;
                TxAllowed = 0;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
            if(((1 == LL_SPI_IsActiveFlag_RXWNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) || (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)>0)) && (localVarRx < datalength) && (TxAllowed==0))
            {
                readdata[localVarRx] = LL_SPI_ReceiveData32((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                //ret = (uint16_T)LL_SPI_IsActiveFlag_OVR((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVarRx++;
                TxAllowed = 1;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
        }
    }

    error:

    return (MW_SPI_Status_Type)ret;
    #else
    return -1;
    #endif
}
#else
__STATIC_INLINE MW_SPI_Status_Type MW_SPI_MasterWriteRead_Databits(STM32_SPI_ModuleStruct_T* SPIModuleHandle, const void * wrData, void * rdData, uint16_T fifo_access, uint32_T datalength, uint16_T blockingMode, uint32_T Timeout)
{
    #ifndef MATLAB_MEX_FILE
    uint16_T localVarTx;
    uint16_T localVarRx;
    uint16_T ret = MW_SPI_SUCCESS;
    uint32_T initialTime = 0;
    initialTime = GET_CURRENT_TIME();

    uint16_T TxAllowed =1;

    if(blockingMode==0)
    {Timeout=0;}

