skocharyan/Mux/otherFiles/mw_stm32_spi_ll.h
    if(LL_SPI_IsEnabled((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==0)
    {
        LL_SPI_Enable((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
    }

    if(FIFO_ACCESS_8BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint8_T *readdata = (uint8_T*) rdData;
        uint8_T *writedata = (uint8_T*) wrData;
        localVarTx = 0;
        localVarRx = 0;
        while (localVarTx < datalength || localVarRx < datalength)
        {
            if((1 == LL_SPI_IsActiveFlag_TXE ((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (TxAllowed==1) && (localVarTx < datalength))
            {
                LL_SPI_TransmitData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr, writedata[localVarTx]);
                localVarTx++;
                TxAllowed = 0;

            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
            if((1 == LL_SPI_IsActiveFlag_RXNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (localVarRx < datalength) && (TxAllowed==0))
            {
                readdata[localVarRx] = LL_SPI_ReceiveData8((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                //ret |= (uint16_T)LL_SPI_IsActiveFlag_OVR((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVarRx++;
                TxAllowed = 1;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
        }
    }
    else if(FIFO_ACCESS_16BIT == (MW_STM32_SPI_FIFO_Access_type)fifo_access)
    {
        uint16_T *readdata = (uint16_T*) rdData;
        uint16_T *writedata = (uint16_T*) wrData;
        localVarTx = 0;
        localVarRx = 0;
        while (localVarTx < datalength || localVarRx < datalength)
        {
            if((1 == LL_SPI_IsActiveFlag_TXE ((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (TxAllowed==1) && (localVarTx < datalength))
            {
                LL_SPI_TransmitData16((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr, writedata[localVarTx]);
                localVarTx++;
                TxAllowed = 0;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
            if((1 == LL_SPI_IsActiveFlag_RXNE((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)) && (localVarRx < datalength) && (TxAllowed==0))
            {
                readdata[localVarRx] = LL_SPI_ReceiveData16((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                //ret |= (uint16_T)LL_SPI_IsActiveFlag_OVR((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr);
                localVarRx++;
                TxAllowed = 1;
            }
            else
            {
                if(returnTimeElapsed(initialTime, 1) > Timeout)
                {
                    ret = MW_SPI_BUSY;
                    goto error;
                }
            }
        }
    }

    error:
    if(LL_SPI_GetMode((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)==LL_SPI_MODE_MASTER)
    {while(LL_SPI_IsActiveFlag_BSY((SPI_TypeDef *)SPIModuleHandle->PeripheralPtr)){}
    }
    return (MW_SPI_Status_Type)ret;
    #else
    return -1;
    #endif
}
#endif
#if defined(STM32H7) || defined(STM32U5)
__STATIC_INLINE void MW_SPI_Disable(SPI_TypeDef *SPIx)
{
    if(LL_SPI_IsEnabled(SPIx)){
        if((LL_SPI_GetMode(SPIx)==LL_SPI_MODE_MASTER))
        {
            if((LL_SPI_GetTransferDirection(SPIx)==LL_SPI_HALF_DUPLEX_RX))
            {
                LL_SPI_SuspendMasterTransfer(SPIx);
                while((LL_SPI_IsActiveFlag_RXWNE(SPIx)>0) || (LL_SPI_GetRxFIFOPackingLevel(SPIx)>0) || (LL_SPI_IsActiveFlag_RXP(SPIx)>0))
                {
                    LL_SPI_ReceiveData8(SPIx);
                }
                LL_SPI_Disable(SPIx);
            }
            else
            {
                while((LL_SPI_IsActiveFlag_TXC(SPIx)!=1) && (LL_SPI_IsActiveFlag_EOT(SPIx)!=1)){}
                while((LL_SPI_IsActiveFlag_RXWNE(SPIx)>0) || (LL_SPI_GetRxFIFOPackingLevel(SPIx)>0) || (LL_SPI_IsActiveFlag_RXP(SPIx)>0))
                {
                    LL_SPI_ReceiveData8(SPIx);
                }
                LL_SPI_Disable(SPIx);
            }
        }
        else
        {
            LL_SPI_Disable(SPIx);
        }
    }
}
#elif defined(STM32F4)
__STATIC_INLINE void MW_SPI_Disable(SPI_TypeDef *SPIx)
{
    if(LL_SPI_IsEnabled(SPIx)){
        if(LL_SPI_GetTransferDirection(SPIx)==LL_SPI_FULL_DUPLEX)
        {
            while(LL_SPI_IsActiveFlag_BSY(SPIx)){};
            LL_SPI_Disable(SPIx);
        }
        else if((LL_SPI_GetTransferDirection(SPIx)==LL_SPI_SIMPLEX_RX)||(LL_SPI_GetTransferDirection(SPIx)==LL_SPI_HALF_DUPLEX_RX))
        {
            LL_SPI_Disable(SPIx);
        }
        else
        {
            while(LL_SPI_IsActiveFlag_BSY(SPIx)){};
            LL_SPI_Disable(SPIx);
        }
    }
}
#else
__STATIC_INLINE void MW_SPI_Disable(SPI_TypeDef *SPIx)
{
    if(LL_SPI_IsEnabled(SPIx)){
        if((LL_SPI_GetMode(SPIx)==LL_SPI_MODE_MASTER))
        {
            if((LL_SPI_GetTransferDirection(SPIx)==LL_SPI_HALF_DUPLEX_RX))
            {
                LL_SPI_Disable(SPIx);
                while(LL_SPI_IsActiveFlag_BSY(SPIx));
                while(LL_SPI_GetRxFIFOLevel(SPIx)>0)
                {
                    LL_SPI_ReceiveData8(SPIx);
                }
            }
            else
            {
                while(LL_SPI_GetTxFIFOLevel(SPIx)>0);
                while(LL_SPI_IsActiveFlag_BSY(SPIx));
                LL_SPI_Disable(SPIx);
                while(LL_SPI_GetRxFIFOLevel(SPIx)>0)
                {
                    LL_SPI_ReceiveData8(SPIx);
                }
            }
        }
        else
        {
            LL_SPI_Disable(SPIx);
        }
    }
}
#endif
STM32_SPI_ModuleStruct_T * SPI_STM32_Init(STM32_SPI_ModuleStruct_T * spi_module);
void MW_STM32_EnableSPIx_Interrupts(STM32_SPI_ModuleStruct_T* SPIModuleHandle, uint16_T interruptsToEnable);
void MW_SPI_STM32_H7xx_FIFO_Init(STM32_SPI_ModuleStruct_T* SPIModuleHandle, uint16_T spiModule, uint16_T fifolevel);
MW_SPI_Status_Type MW_STM32_SPI_SetFormat(STM32_SPI_ModuleStruct_T* SPIModuleHandle, uint16_T spiModule,  uint32_T targetprecision, MW_SPI_Mode_type spi_mode);

#endif /* __MW_STM32_SPI_LL_H__ */

/* LocalWords:  OVR
*/
